Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFE124.atdf
      <value-group caption="ADC0 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN0">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1"/>
         <value caption="Analog and bias circuitry disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC1 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN1">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1"/>
         <value caption="Analog and bias circuitry disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC2 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN2">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1"/>
         <value caption="Analog and bias circuitry disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC3 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN3">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1"/>
         <value caption="Analog and bias circuitry disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC4 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN4">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1"/>
         <value caption="Analog and bias circuitry disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN7">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1"/>
         <value caption="Analog and bias circuitry disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 0 Wake-up Status bit" name="ADCANCON__WKRDY0">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1"/>
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 1 Wake-up Status bit" name="ADCANCON__WKRDY1">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1"/>
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 2 Wake-up Status bit" name="ADCANCON__WKRDY2">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1"/>
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 3 Wake-up Status bit" name="ADCANCON__WKRDY3">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1"/>
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 4 Wake-up Status bit" name="ADCANCON__WKRDY4">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1"/>
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Wake-up Status bit" name="ADCANCON__WKRDY7">
         <value caption="ADC7 Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANEN7 to 1" name="" value="0x1"/>
         <value caption="ADC7 Analog and Bias circuitry is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 0 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN0">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1"/>
         <value caption="Disable interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 1 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN1">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1"/>
         <value caption="Disable interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 2 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN2">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1"/>
         <value caption="Disable interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 3 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN3">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1"/>
         <value caption="Disable interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC 4 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN4">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1"/>
         <value caption="Disable interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN7">
         <value caption="Enable interrupt and generate interrupt when the WKRDY7 status bit is set" name="" value="0x1"/>
         <value caption="Disable interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Wake-up Clock Count bits" name="ADCANCON__WKUPCLKCNT">
         <value caption="32" name="" value="0xf"/>
         <value caption="64 clocks" name="" value="0x6"/>
         <value caption="32 clocks" name="" value="0x5"/>
         <value caption="16 clocks" name="" value="0x4"/>
         <value caption="16 clocks" name="" value="0x3"/>
         <value caption="16 clocks" name="" value="0x2"/>
         <value caption="16 clocks" name="" value="0x1"/>
         <value caption="16 clocks" name="" value="0x0"/>
      </value-group>
   </module>
