Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFE124.atdf
      <value-group caption="Repeated Start Condition Enable bit" name="I2C5CON__RSEN">
         <value caption="Initiate Repeated Start condition on SDAx and SCLx pins. Hardware clear at end of master Repeated Start sequence." name="" value="0x1"/>
         <value caption="Repeated Start condition not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop Condition Enable bit" name="I2C5CON__PEN">
         <value caption="Initiate Stop condition on SDAx and SCLx pins. Hardware clear at end of master Stop sequence." name="" value="0x1"/>
         <value caption="Stop condition not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Enable bit" name="I2C5CON__RCEN">
         <value caption="Enables Receive mode for I2C. Hardware clear at end of eighth bit of master receive data byte." name="" value="0x1"/>
         <value caption="Receive sequence not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Acknowledge Sequence Enable bit" name="I2C5CON__ACKEN">
         <value caption="Initiate Acknowledge sequence on SDAx and SCLx pins and transmit ACKDT data bit. Hardware clear at end of master Acknowledge sequence." name="" value="0x1"/>
         <value caption="Acknowledge sequence not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Acknowledge Data bit" name="I2C5CON__ACKDT">
         <value caption="Send NACK during Acknowledge" name="" value="0x1"/>
         <value caption="Send ACK during Acknowledge" name="" value="0x0"/>
      </value-group>
      <value-group caption="SCLx Clock Stretch Enable" name="I2C5CON__STREN">
         <value caption="Enable software or receive clock stretching" name="" value="0x1"/>
         <value caption="Disable software or receive clock stretching" name="" value="0x0"/>
      </value-group>
      <value-group caption="General Call Enable" name="I2C5CON__GCEN">
         <value caption="Enable interrupt when a general call address is received in the I2CxRSR(module is enabled for reception)" name="" value="0x1"/>
         <value caption="General call address is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SMBus Input Levels" name="I2C5CON__SMEN">
         <value caption="Enable I/O pin thresholds compliant with SMBus specification" name="" value="0x1"/>
         <value caption="Disable SMBus input thresholds" name="" value="0x0"/>
      </value-group>
      <value-group caption="Disable Slew Rate Control" name="I2C5CON__DISSLW">
         <value caption="Slew rate control is disabled" name="" value="0x1"/>
         <value caption="Slew rate control is enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="10-bit Slave Address" name="I2C5CON__A10M">
         <value caption="I2CxADD is a 10-bit slave address" name="" value="0x1"/>
         <value caption="I2CxADD is a 7-bit slave address" name="" value="0x0"/>
      </value-group>
      <value-group caption="Strict I 2 C Reserved Address Rule Enable" name="I2C5CON__STRICT">
         <value caption="Strict reserved addressing is enforced. Device does not respond to reserved address space or generate addresses in reserved address space." name="" value="0x1"/>
         <value caption="Strict I2C Reserved Address Rule is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SCLx Release Control bit" name="I2C5CON__SCLREL">
         <value caption="Release SCLx clock" name="" value="0x1"/>
         <value caption="Hold SCLx clock low (clock stretch)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="I2C5CON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1"/>
         <value caption="Continue module operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="I2C Enable bit" name="I2C5CON__ON">
         <value caption="Enables the I2C module and configures the SDA and SCL pins as serial port pins" name="" value="0x1"/>
         <value caption="Disables the I2C module; all I2C pins are controlled by PORT functions" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Hold Enable bit" name="I2C5CON__DHEN">
         <value caption="Following the 8th falling edge of SCL for a received data byte; slave hardware clears the SCKREL bit and SCL is held low" name="" value="0x1"/>
         <value caption="Data holding is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Address Hold Enable bit" name="I2C5CON__AHEN">
         <value caption="Following the 8th falling edge of SCL for a matching received address byte; SCKREL bit will be cleared and the SCL will be held low." name="" value="0x1"/>
         <value caption="Address holding is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Slave Mode Bus Collision Detect Enable bit" name="I2C5CON__SBCDE">
         <value caption="Enable slave bus collision interrupts" name="" value="0x1"/>
         <value caption="Slave bus collision interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SDA Hold Time Selection bit" name="I2C5CON__SDAHT">
         <value caption="Minimum of 300 ns hold time on SDA after the falling edge of SCL" name="" value="0x1"/>
         <value caption="Minimum of 100 ns hold time on SDA after the falling edge of SCL" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Overwrite Enable bit" name="I2C5CON__BOEN">
         <value caption="I2CxRCV is updated and" name="" value="0x1"/>
         <value caption="I2CxRCV is only updated when the I2COV bit (I2CxSTAT) is clear" name="" value="0x0"/>
      </value-group>
      <value-group caption="Start Condition Interrupt Enable bit" name="I2C5CON__SCIE">
         <value caption="Enable interrupt on detection of Start or Restart conditions" name="" value="0x1"/>
         <value caption="Start detection interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop Condition Interrupt Enable bit" name="I2C5CON__PCIE">
         <value caption="Enable interrupt on detection of Stop condition" name="" value="0x1"/>
         <value caption="Stop detection interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit" name="I2C1STAT__TBF">
         <value caption="Transmit in progress" name="" value="0x1"/>
         <value caption="Transmit complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Full Status bit" name="I2C1STAT__RBF">
         <value caption="Receive complete" name="" value="0x1"/>
         <value caption="Receive not complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Read/Write Information bit" name="I2C1STAT__R_W">
         <value caption="Read indicates data transfer is output from slave" name="" value="0x1"/>
         <value caption="Write indicates data transfer is input to slave" name="" value="0x0"/>
      </value-group>
      <value-group caption="Start bit" name="I2C1STAT__S">
         <value caption="Indicates that a Start (or Repeated Start) bit has been detected last" name="" value="0x1"/>
         <value caption="Start bit was not detected last" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop bit" name="I2C1STAT__P">
         <value caption="Indicates that a Stop bit has been detected last" name="" value="0x1"/>
         <value caption="Stop bit was not detected last" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data/Address bit" name="I2C1STAT__D_A">
         <value caption="Indicates that the last byte received was data" name="" value="0x1"/>
         <value caption="Indicates that the last byte received was device address" name="" value="0x0"/>
      </value-group>
